; domain
(define (domain driverlog)
  (:requirements :typing :fluents)
  (:types
    location locatable - object
    driver truck obj - locatable
  )

  (:predicates
    (at ?obj - locatable ?loc - location)
    (in ?obj1 - obj ?obj - truck)
    (driving ?d - driver ?v - truck)
    (link ?x - location ?y - location)
    (path ?x - location ?y - location)
    (empty ?v - truck)
  )
  (:functions
    (time-to-walk ?l1 - location ?l2 - location)
    (time-to-drive ?l1 - location ?l2 - location)
    (driven)
    (walked)
  )

  (:action LOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and
      (at ?truck ?loc)
      (at ?obj ?loc))
    :effect (and (not (at ?obj ?loc)) (in ?obj ?truck))
  )

  (:action UNLOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (in ?obj ?truck))
    :effect (and (not (in ?obj ?truck)) (at ?obj ?loc))
  )

  (:action BOARD-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
    :effect (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck)))
  )

  (:action DISEMBARK-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (driving ?driver ?truck))
    :effect (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck))
  )

  (:action DRIVE-TRUCK
    :parameters (?truck - truck ?loc-from - location ?loc-to - location ?driver - driver)
    :precondition (and (at ?truck ?loc-from)
      (driving ?driver ?truck) (link ?loc-from ?loc-to))
    :effect (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
      (increase
        (driven)
        (time-to-drive ?loc-from ?loc-to)))
  )

  (:action WALK
    :parameters (?driver - driver ?loc-from - location ?loc-to - location)
    :precondition (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
    :effect (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)
      (increase
        (walked)
        (time-to-walk ?loc-from ?loc-to)))
  )

)

; problem
(define (problem DLOG-4-3-2)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	package1 - obj
	package2 - obj
	s0 - location
	s1 - location
	s2 - location
	p0-1 - location
	p0-2 - location
	p1-2 - location
	)
	(:init
	(at driver1 s1)
	(at driver2 s1)
	(at driver3 s1)
	(at driver4 s1)
	(at truck1 s2)
	(empty truck1)
	(at truck2 s2)
	(empty truck2)
	(at truck3 s0)
	(empty truck3)
	(at package1 s1)
	(at package2 s2)
	(path s0 p0-1)
	(path p0-1 s0)
	(path s1 p0-1)
	(path p0-1 s1)
	(= (time-to-walk s0 p0-1) 77)
	(= (time-to-walk p0-1 s0) 77)
	(= (time-to-walk s1 p0-1) 41)
	(= (time-to-walk p0-1 s1) 41)
	(path s0 p0-2)
	(path p0-2 s0)
	(path s2 p0-2)
	(path p0-2 s2)
	(= (time-to-walk s0 p0-2) 55)
	(= (time-to-walk p0-2 s0) 55)
	(= (time-to-walk s2 p0-2) 24)
	(= (time-to-walk p0-2 s2) 24)
	(path s1 p1-2)
	(path p1-2 s1)
	(path s2 p1-2)
	(path p1-2 s2)
	(= (time-to-walk s1 p1-2) 84)
	(= (time-to-walk p1-2 s1) 84)
	(= (time-to-walk s2 p1-2) 26)
	(= (time-to-walk p1-2 s2) 26)
	(link s0 s2)
	(link s2 s0)
	(= (time-to-drive s0 s2) 38)
	(= (time-to-drive s2 s0) 38)
	(link s1 s0)
	(link s0 s1)
	(= (time-to-drive s1 s0) 43)
	(= (time-to-drive s0 s1) 43)
	(link s2 s1)
	(link s1 s2)
	(= (time-to-drive s2 s1) 18)
	(= (time-to-drive s1 s2) 18)
	(= (driven) 0)
	(= (walked) 0)
)
	(:goal (and
	(at driver2 s2)
	(at driver3 s2)
	(at truck3 s0)
	(at package1 s2)
	(at package2 s1)
	))

(:metric minimize (+ (+ (* 1  (total-time)) (* 1  (driven))) (* 4  (walked))))

)

; plan
1. (walk driver3 s1 p1-2)
   deleted: (at driver3 s1)
   added: (at driver3 p1-2)
   changed: (walked) from 0 to 84
   goals met: 1 of 5
2. (walk driver3 p1-2 s2)
   deleted: (at driver3 p1-2)
   added: (at driver3 s2)
   changed: (walked) from 84 to 110
   goals met: 2 of 5
3. (board-truck driver3 truck1 s2)
   deleted: (at driver3 s2) (empty truck1)
   added: (driving driver3 truck1)
   goals met: 1 of 5
4. (walk driver2 s1 p1-2)
   deleted: (at driver2 s1)
   added: (at driver2 p1-2)
   changed: (walked) from 110 to 194
   goals met: 1 of 5
5. (walk driver2 p1-2 s2)
   deleted: (at driver2 p1-2)
   added: (at driver2 s2)
   changed: (walked) from 194 to 220
   goals met: 2 of 5
6. (load-truck package2 truck1 s2)
   deleted: (at package2 s2)
   added: (in package2 truck1)
   goals met: 2 of 5
7. (drive-truck truck1 s2 s1 driver3)
   deleted: (at truck1 s2)
   added: (at truck1 s1)
   changed: (driven) from 0 to 18
   goals met: 2 of 5
8. (unload-truck package2 truck1 s1)
   deleted: (in package2 truck1)
   added: (at package2 s1)
   goals met: 3 of 5
9. (load-truck package1 truck1 s1)
   deleted: (at package1 s1)
   added: (in package1 truck1)
   goals met: 3 of 5
10. (drive-truck truck1 s1 s2 driver3)
   deleted: (at truck1 s1)
   added: (at truck1 s2)
   changed: (driven) from 18 to 36
   goals met: 3 of 5
11. (disembark-truck driver3 truck1 s2)
   deleted: (driving driver3 truck1)
   added: (at driver3 s2) (empty truck1)
   goals met: 4 of 5
12. (unload-truck package1 truck1 s2)
   deleted: (in package1 truck1)
   added: (at package1 s2)
   goals met: 5 of 5
